In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_excel("C:\\Users\\Administrator\\Downloads\\South Crime Details.xlsx\\South Crime Details.xlsx")

C:\ProgramData\anaconda3\Lib\site-packages\openpyxl\worksheet\_read_only.py:85: UserWarning: Cell D5859 is marked as a date but the serial value 6616895 is outside the limits for dates. The cell will be treated as an error.
  for idx, row in parser.parse():

In [3]:
print(df.shape)

(9241, 8)

In [4]:
df.head()

,Police Station,Year,Type,Date,Time,Place,Latitude,Longitude
0,Banashankari,2016.0,Murder,29/07/2016,21:00:00,"22nd Cross, Jayanagara 6th Block Bangalore",12.93297,77.58381
1,Banashankari,2016.0,Murder,13/11/2016,23:45:00,"On the Road of 30th Cross, Opp Vinayaka textti...",12.930433,77.549761
2,Banashankari,2017.0,Murder,2017-10-05 00:00:00,21:00:00,"No. 282, 36th Cross Jayanagara 7th Block Banga...",12.923736,77.58182
3,Banashankari,2017.0,Murder,19/07/2017,19:30:00,"Near Transfaram, Opp Amejan, Kanakapura Main R...",12.924123,77.576913
4,Banashankari,2018.0,Murder,21/06/2018,23:30:00,"No. 53, 2nd Floor, 8th Main 4th Block Jayanaga...",12.924377,77.582729

In [5]:
df.columns = df.columns.str.strip().str.lower().str.replace(" ", "_")
print(df.columns)

Index(['police_station', 'year', 'type', 'date', 'time', 'place', 'latitude',
       'longitude'],
      dtype='object')

In [6]:
df.columns = df.columns.str.strip().str.lower().str.replace(" ", "_")
print(df.columns)

Index(['police_station', 'year', 'type', 'date', 'time', 'place', 'latitude',
       'longitude'],
      dtype='object')

In [7]:
df = df.drop(columns=["date"])

In [8]:
df.head()

,police_station,year,type,time,place,latitude,longitude
0,Banashankari,2016.0,Murder,21:00:00,"22nd Cross, Jayanagara 6th Block Bangalore",12.93297,77.58381
1,Banashankari,2016.0,Murder,23:45:00,"On the Road of 30th Cross, Opp Vinayaka textti...",12.930433,77.549761
2,Banashankari,2017.0,Murder,21:00:00,"No. 282, 36th Cross Jayanagara 7th Block Banga...",12.923736,77.58182
3,Banashankari,2017.0,Murder,19:30:00,"Near Transfaram, Opp Amejan, Kanakapura Main R...",12.924123,77.576913
4,Banashankari,2018.0,Murder,23:30:00,"No. 53, 2nd Floor, 8th Main 4th Block Jayanaga...",12.924377,77.582729

In [9]:
df.shape

(9241, 7)

In [10]:
df["time_clean"] = (
    df["time"]
    .astype(str)
    .str.lower()
    .str.replace("hrs", "", regex=False)
    .str.replace("hour", "", regex=False)
    .str.strip()
)

In [11]:
df["hour"] = pd.to_datetime(
    df["time_clean"],
    errors="coerce"
).dt.hour

C:\Users\Administrator\AppData\Local\Temp\ipykernel_11548\4220846610.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df["hour"] = pd.to_datetime(

In [12]:
df["hour"] = pd.to_datetime(df["time_clean"],errors="coerce").dt.hour

C:\Users\Administrator\AppData\Local\Temp\ipykernel_11548\1721382110.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df["hour"] = pd.to_datetime(df["time_clean"],errors="coerce").dt.hour

In [13]:
print("Invalid hour values:", df["hour"].isna().sum())

df = df.dropna(subset=["hour"])

Invalid hour values: 1583

In [14]:
df.shape

(7658, 9)

In [15]:
df.head()

,police_station,year,type,time,place,latitude,longitude,time_clean,hour
0,Banashankari,2016.0,Murder,21:00:00,"22nd Cross, Jayanagara 6th Block Bangalore",12.93297,77.58381,21:00:00,21.0
1,Banashankari,2016.0,Murder,23:45:00,"On the Road of 30th Cross, Opp Vinayaka textti...",12.930433,77.549761,23:45:00,23.0
2,Banashankari,2017.0,Murder,21:00:00,"No. 282, 36th Cross Jayanagara 7th Block Banga...",12.923736,77.58182,21:00:00,21.0
3,Banashankari,2017.0,Murder,19:30:00,"Near Transfaram, Opp Amejan, Kanakapura Main R...",12.924123,77.576913,19:30:00,19.0
4,Banashankari,2018.0,Murder,23:30:00,"No. 53, 2nd Floor, 8th Main 4th Block Jayanaga...",12.924377,77.582729,23:30:00,23.0

In [16]:
df["is_night"] = df["hour"].apply(
    lambda x: 1 if x >= 19 or x <= 5 else 0
)

In [17]:
df["latitude"] = (
    df["latitude"]
    .astype(str)
    .str.strip()
    .str.replace(",", "")
)

df["longitude"] = (
    df["longitude"]
    .astype(str)
    .str.strip()
    .str.replace(",", "")
)

df["latitude"] = pd.to_numeric(df["latitude"], errors="coerce")
df["longitude"] = pd.to_numeric(df["longitude"], errors="coerce")

In [18]:
df = df.dropna(
    subset=["year", "latitude", "longitude"]
)

In [20]:
df.shape

(6846, 10)

In [21]:
df.head()

,police_station,year,type,time,place,latitude,longitude,time_clean,hour,is_night
0,Banashankari,2016.0,Murder,21:00:00,"22nd Cross, Jayanagara 6th Block Bangalore",12.932970,77.583810,21:00:00,21.0,1
1,Banashankari,2016.0,Murder,23:45:00,"On the Road of 30th Cross, Opp Vinayaka textti...",12.930433,77.549761,23:45:00,23.0,1
2,Banashankari,2017.0,Murder,21:00:00,"No. 282, 36th Cross Jayanagara 7th Block Banga...",12.923736,77.581820,21:00:00,21.0,1
3,Banashankari,2017.0,Murder,19:30:00,"Near Transfaram, Opp Amejan, Kanakapura Main R...",12.924123,77.576913,19:30:00,19.0,1
4,Banashankari,2018.0,Murder,23:30:00,"No. 53, 2nd Floor, 8th Main 4th Block Jayanaga...",12.924377,77.582729,23:30:00,23.0,1

In [22]:
df=df.drop_duplicates()

In [23]:
df.shape

(6844, 10)

In [24]:
print("Final dataset shape:", df.shape)
df.info()
df.head()

Final dataset shape: (6844, 10)
<class 'pandas.core.frame.DataFrame'>
Index: 6844 entries, 0 to 9240
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   police_station  6844 non-null   object
 1   year            6844 non-null   float64
 2   type            6844 non-null   object
 3   time            6844 non-null   object
 4   place           6843 non-null   object
 5   latitude        6844 non-null   float64
 6   longitude       6844 non-null   float64
 7   time_clean      6844 non-null   object
 8   hour            6844 non-null   float64
 9   is_night        6844 non-null   int64
dtypes: float64(4), int64(1), object(5)
memory usage: 588.2+ KB

,police_station,year,type,time,place,latitude,longitude,time_clean,hour,is_night
0,Banashankari,2016.0,Murder,21:00:00,"22nd Cross, Jayanagara 6th Block Bangalore",12.932970,77.583810,21:00:00,21.0,1
1,Banashankari,2016.0,Murder,23:45:00,"On the Road of 30th Cross, Opp Vinayaka textti...",12.930433,77.549761,23:45:00,23.0,1
2,Banashankari,2017.0,Murder,21:00:00,"No. 282, 36th Cross Jayanagara 7th Block Banga...",12.923736,77.581820,21:00:00,21.0,1
3,Banashankari,2017.0,Murder,19:30:00,"Near Transfaram, Opp Amejan, Kanakapura Main R...",12.924123,77.576913,19:30:00,19.0,1
4,Banashankari,2018.0,Murder,23:30:00,"No. 53, 2nd Floor, 8th Main 4th Block Jayanaga...",12.924377,77.582729,23:30:00,23.0,1

In [26]:
df.to_csv("cleaned_bengaluru_crime_data1.csv", index=False)

In [27]:
df["year"] = df["year"].astype(int)
df["hour"] = df["hour"].astype(int)

In [29]:
df.head()

,police_station,year,type,time,place,latitude,longitude,time_clean,hour,is_night
0,Banashankari,2016,Murder,21:00:00,"22nd Cross, Jayanagara 6th Block Bangalore",12.932970,77.583810,21:00:00,21,1
1,Banashankari,2016,Murder,23:45:00,"On the Road of 30th Cross, Opp Vinayaka textti...",12.930433,77.549761,23:45:00,23,1
2,Banashankari,2017,Murder,21:00:00,"No. 282, 36th Cross Jayanagara 7th Block Banga...",12.923736,77.581820,21:00:00,21,1
3,Banashankari,2017,Murder,19:30:00,"Near Transfaram, Opp Amejan, Kanakapura Main R...",12.924123,77.576913,19:30:00,19,1
4,Banashankari,2018,Murder,23:30:00,"No. 53, 2nd Floor, 8th Main 4th Block Jayanaga...",12.924377,77.582729,23:30:00,23,1

In [30]:
df["place"] = df["place"].fillna("Unknown")

In [31]:
df = df.drop(columns=["time", "time_clean"])

In [32]:
df.head()

,police_station,year,type,place,latitude,longitude,hour,is_night
0,Banashankari,2016,Murder,"22nd Cross, Jayanagara 6th Block Bangalore",12.932970,77.583810,21,1
1,Banashankari,2016,Murder,"On the Road of 30th Cross, Opp Vinayaka textti...",12.930433,77.549761,23,1
2,Banashankari,2017,Murder,"No. 282, 36th Cross Jayanagara 7th Block Banga...",12.923736,77.581820,21,1
3,Banashankari,2017,Murder,"Near Transfaram, Opp Amejan, Kanakapura Main R...",12.924123,77.576913,19,1
4,Banashankari,2018,Murder,"No. 53, 2nd Floor, 8th Main 4th Block Jayanaga...",12.924377,77.582729,23,1

In [33]:
df.to_csv("cleaned_bengaluru_crime_data1.csv", index=False)